In [2]:
import pandas as pd

In [38]:
df = pd.read_csv('https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv')

In [47]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,CabinType,CabinNo,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,NaN,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,NaN,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,C,123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,NaN,NaN,S

**1 . Find out how many male and female passenger was onboarded .**

In [24]:
df['Sex'].value_counts()

314

**2. how many survived we have .**

In [25]:
df['Survived'].value_counts()[1]

342

In [17]:
len(df[df['Survived']==1])

342

**3. how many casuality we have**

**4 . what is name of a person who is the eldest one .**

In [35]:
df[df['Age'] == max(df['Age'])]['Name']

630    Barkworth, Mr. Algernon Henry Wilson
Name: Name, dtype: object

**5 . how many passenger do we have in first , second and third class**

In [37]:
df['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

**6. how many person we have whose name starts with "s"**

In [45]:
len(df[df['Name'].str.startswith("S") == True])

86

**7. try to create a new column which is a summation  of "SibSp" and "parch"**

In [10]:
df['Family_member'] = df['SibSp'] + df['Parch']

In [12]:
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Family_member
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,1

**8 . how many person do we have below age of 25 .**

In [13]:
len(df[df['Age']<23])

231

**9 . how many person died whose age was less then 40**

In [25]:
len(df[(df['Survived'] == 0) & (df['Age']<40)])

322

**10 . from a  cabin column seperate text and numeric value .**

In [46]:
df['Cabin'].value_counts()

B96 B98        4
C23 C25 C27    4
G6             4
F33            3
F2             3
              ..
D49            1
C148           1
B79            1
C49            1
D15            1
Name: Cabin, Length: 147, dtype: int64

In [39]:
cabin=df['Cabin']
cabin_no=[]
cabin_type=[]
for i in cabin:
    if type(i) == str:
        values=i.strip().split(" ")
        if  len(values) > 1:
            cno=""
            ctype=""
            sep=","
            for j in range(len(values)):
                if j == (len(values)-1):
                    sep=""
                cno=cno+values[j][1:]+sep
                ctype+=values[j][0:1]+sep
            #print(cno,ctype)
            cabin_no.append(cno)
            cabin_type.append(ctype)
        else:
            cabin_no.append(i[1:])
            cabin_type.append(i[0:1])
    else:
        cabin_no.append(i)
        cabin_type.append(i)

In [40]:
index=df.columns.get_loc('Cabin')
df.insert(index+1,'CabinType',cabin_type)
df.insert(index+2,'CabinNo',cabin_no)

In [42]:
df[(df['PassengerId']==873)|(df['PassengerId']==28)|(df['PassengerId']==76)]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,CabinType,CabinNo,Embarked
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.00,C23 C25 C27,"C,C,C","23,25,27",S
75,76,0,3,"Moen, Mr. Sigurd Hansen",male,25.0,0,0,348123,7.65,F G73,"F,G",",73",S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.00,B51 B53 B55,"B,B,B","51,53,55",S